## Libraries

In [165]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import aux_functions as f

## 0. Import data

![Descripción de la imagen](../Datasets/diagrama_entidad_relacion.png)

In [166]:
df_customer = pd.read_csv("../Datasets/customers_1.txt")
df_employees = pd.read_csv("../Datasets/employees_1.txt")
df_inventory = pd.read_csv("../Datasets/inventory_transactions_1.txt")
df_order_details = pd.read_csv("../Datasets/order_details_1.txt")
df_orders = pd.read_csv("../Datasets/orders_1.txt")
df_payment_methods = pd.read_csv("../Datasets/payment_methods_1.txt")
df_payments = pd.read_csv("../Datasets/payments_1.txt")
df_products = pd.read_csv("../Datasets/products_1.txt")
df_purchase_orders = pd.read_csv("../Datasets/purchase_orders_1.txt")
df_shipping_methods = pd.read_csv("../Datasets/shipping_methods_1.txt")
df_suppliers = pd.read_csv("../Datasets/suppliers_1.txt")

## 1. Cleaning and review

### 1.1 Customers

Summary:
- There are 225 customer
- Origin: Russian Federation and Belarus. Specially, from 87 regions.
- These customers can be classified by: Price Category (there are 7; 1-7), Customer Class ('Large-Scale Wholesaler-1', 'Consumer', 'Retailer',
       'Small-Scale Wholesaler', 'Large-Scale Wholesaler-2', 'Branch',
       'HyPermarket'), Lead Source ('Referral by the Central Office', 'Other',
       'Advertisement in National Wholesale Magazine',
       'Sales Calls or Visits', 'Trade Shows',
       'Referral by Third Parties', nan, 'Organic Search',
       'Advertisement in Regional Wholesaler Magazine') and if they are continued or not

No se si eliminar los que tienen valores nulos en leadSource (son 4)

In [167]:
df_customer

,CustomerID,CustomerName,Region,Country,PriceCategory,CustomerClass,LeadSource,Discontinued
0,1,C1,Moscow,Russian Federation,1,Large-Scale Wholesaler-1,Referral by the Central Office,0
1,2,C2,Moscow,Russian Federation,1,Large-Scale Wholesaler-1,Referral by the Central Office,0
2,3,C3,Moscow,Russian Federation,1,Large-Scale Wholesaler-1,Referral by the Central Office,1
3,4,C4,Moscow,Russian Federation,4,Large-Scale Wholesaler-1,Referral by the Central Office,1
4,5,C5,Moscow,Russian Federation,1,Large-Scale Wholesaler-1,Referral by the Central Office,0
...,...,...,...,...,...,...,...,...
220,243,C221,Vologda,Russian Federation,4,Small-Scale Wholesaler,Advertisement in National Wholesale Magazine,0
221,244,C222,Yakutsk,Russian Federation,4,Small-Scale Wholesaler,Advertisement in National Wholesale Magazine,0
222,245,C223,Nizhny Novgorod,Russian Federation,5,Retailer,Sales Calls or Visits,0
223,246,C224,Kemerovo,Russian Federation,4,Small-Scale Wholesaler,Sales Calls or Visits,0
224,247,C225,Moscow,Russian Federation,4,Small-Scale Wholesaler,Sales Calls or Visits,0

In [168]:
f.analysis_data(df_customer, "customer")

There are 225 of customer
-----------------------

Null values:

CustomerID       0
CustomerName     0
Region           0
Country          0
PriceCategory    0
CustomerClass    0
LeadSource       4
Discontinued     0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

CustomerID       225
CustomerName     225
Region            87
Country            2
PriceCategory      7
CustomerClass      7
LeadSource         8
Discontinued       2
dtype: int64
-----------------------

Description:
       CustomerID  PriceCategory  Discontinued
count  225.000000     225.000000    225.000000
mean   124.577778       3.711111      0.115556
std     72.511664       1.523949      0.320404
min      1.000000       1.000000      0.000000
25%     61.000000       2.000000      0.000000
50%    126.000000       4.000000      0.000000
75%    187.000000       5.000000      0.000000
max    247.000000       7.000000      1.000000
-----------------------

CustomerID        int64
CustomerName     object
Region           object
Country          object
PriceCategory     int64
CustomerClass    object
LeadSource       object
Discontinued      int64
dtype: object

In [169]:
df_customer['Country'].unique()

array(['Russian Federation', 'Belarus'], dtype=object)

In [170]:
df_customer['Region'].nunique()

87

In [171]:
df_customer['PriceCategory'].unique()

array([1, 4, 5, 2, 7, 6, 3])

In [172]:
df_customer['CustomerClass'].unique()

array(['Large-Scale Wholesaler-1', 'Consumer', 'Retailer',
       'Small-Scale Wholesaler', 'Large-Scale Wholesaler-2', 'Branch',
       'HyPermarket'], dtype=object)

In [173]:
df_customer['LeadSource'].unique()

array(['Referral by the Central Office', 'Other',
       'Advertisement in National Wholesale Magazine',
       'Sales Calls or Visits', 'Trade Shows',
       'Referral by Third Parties', nan, 'Organic Search',
       'Advertisement in Regional Wholesaler Magazine'], dtype=object)

In [174]:
df_customer['Discontinued'].unique()

array([0, 1])

### 1.2 Employees

Summary:
- There are 14 employees

In [175]:
df_employees

    EmployeeID EmployeeName
0            1           E1
1            2           E2
2            3           E3
3            5           E4
4            6           E5
5            7           E6
6            8           E7
7            9           E8
8           10           E9
9           11          E10
10          12          E11
11          13          E12
12          14          E13
13          15          E14
14          16          E15

In [176]:
f.analysis_data(df_employees, "employees")

There are 15 of employees
-----------------------

Null values:

EmployeeID      0
EmployeeName    0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

EmployeeID      15
EmployeeName    15
dtype: int64
-----------------------

Description:
       EmployeeID
count   15.000000
mean     8.800000
std      4.768947
min      1.000000
25%      5.500000
50%      9.000000
75%     12.500000
max     16.000000
-----------------------

EmployeeID       int64
EmployeeName    object
dtype: object

### 1.3 Inventory Transactions

In [177]:
df_inventory

,TransactionID,ProductID,PurchaseOrderID,MissingID,TransactionDate,UnitPurchasePrice,QuantityOrdered,QuantityReceived,QuantityMissing
0,1,1,NaN,NaN,5/29/2003,NaN,28.0,28.0,NaN
1,2,2,NaN,NaN,5/29/2003,NaN,60.0,60.0,NaN
2,3,3,NaN,NaN,5/29/2003,NaN,60.0,60.0,NaN
3,4,4,NaN,NaN,5/29/2003,NaN,60.0,60.0,NaN
4,6,6,NaN,NaN,5/29/2003,NaN,0.0,0.0,NaN
...,...,...,...,...,...,...,...,...,...
20946,41219,4419,315.0,NaN,4/5/2006,1.3,10.0,10.0,NaN
20947,41220,4420,315.0,NaN,4/5/2006,1.2,10.0,10.0,NaN
20948,41221,4421,315.0,NaN,4/5/2006,1.4,10.0,10.0,NaN
20949,41222,4261,315.0,NaN,4/5/2006,6.0,30.0,30.0,NaN
20950,41223,4317,315.0,NaN,4/5/2006,6.6,30.0,30.0,NaN

In [178]:
f.analysis_data(df_inventory, "inventory transactions")

There are 20951 of inventory transactions
-----------------------

Null values:

TransactionID            0
ProductID                0
PurchaseOrderID       3345
MissingID            18757
TransactionDate          1
UnitPurchasePrice     1151
QuantityOrdered       2195
QuantityReceived      2227
QuantityMissing      18757
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

TransactionID        20951
ProductID             4140
PurchaseOrderID        232
MissingID               27
TransactionDate        180
UnitPurchasePrice      252
QuantityOrdered        268
QuantityReceived       268
QuantityMissing         93
dtype: int64
-----------------------

Description:

       TransactionID     ProductID  PurchaseOrderID    MissingID  \
count   20951.000000  20951.000000     17606.000000  2194.000000
mean    20186.404754   1434.974273       163.757128    10.257065
std     12574.199562   1071.728615        90.254718     9.367187
min         1.000000      1.000000        25.000000     1.000000
25%      8997.500000    674.000000        84.000000     2.000000
50%     20440.000000   1120.000000       154.000000     5.000000
75%     31872.500000   2022.000000       248.000000    19.000000
max     41223.000000   4422.000000       315.000000    29.000000

       UnitPurchasePrice  QuantityOrdered  QuantityReceived  QuantityMissing
count       19800.000000     18756.000000      18724.000000      2194.000000
mean            4.486484        40.939326         40.992576         8.185050
std             2.020887        51.792820         51.887844        32.723404
min             0.000000         0.000000          0.000000         0.000000
25%             3.300000        10.000000         10.000000         0.000000
50%             4.300000        30.000000         30.000000         1.000000
75%             5.350000        50.000000         50.000000         2.000000
max            14.500000      1475.000000       1475.000000       732.000000
-----------------------

TransactionID          int64
ProductID              int64
PurchaseOrderID      float64
MissingID            float64
TransactionDate       object
UnitPurchasePrice    float64
QuantityOrdered      float64
QuantityReceived     float64
QuantityMissing      float64
dtype: object

In [179]:
# Delete MissingID

df_inventory = df_inventory.drop(columns=['MissingID'])

In [180]:
# Convert to int PurchaseOrderID and null values convert to 0
df_inventory['PurchaseOrderID'] = df_inventory['PurchaseOrderID'].fillna(0)

df_inventory['PurchaseOrderID'] = df_inventory['PurchaseOrderID'].apply(lambda x: int(x) if pd.notnull(x) else x)

### 1.4 Products

Summary:
- There are 4169 products (like types + sizes). They can be classified by:
    - **Name** (ex: L-BX46CK, but it is size + product)
    - **Product Type**, there are 1342 differents (BX46CK)
    - **Model Description**, it is the type of product (ex: TANGA KAMP )
    - **Fabric Descriptions** -> there are numbers USELESS COLUMN
    - **Category** -> there are 8 ('Undershirts', 'Briefs', 'Boxers', 'Thongs', 'Slips', 'Drawers',
       'Regular-Over the Calf', 'Cuff-Over the Calf')
    - **Gender:** "Girls' Undershirts", "Boys' Undershirts", "Girls' Panties",
       "Boys' Briefs", "Men's Undershirts", "Women's Undershirts",
       "Women's Panties", "Men's Briefs", "Children's Socks",
       "Women's Socks", "Men's Socks
    - **Product Line:** 'Underwear', 'Socks'
    - **Weight**, integer
    - **Size**: 'M', 'XS', 'S', 'L', 'XL', 'XXL', '3XL', '4XL', 'S-M', 'L-XL',
       '5XL', '6XL', '5', '7', '9', '11', '35-40', '40-46', '13' (numbers are socks)
    - **Packtype**: 'Dozen', 'Single Unit'
    - **Status**: 'In Production', 'Out of Production'
    - **Inventory Date**: from 2003 to 2006
    - **Price**: in range of (0.4, 14.0)

In [181]:
df_products

,ProductID,ProductName,Color,ModelDescription,FabricDescription,Category,Gender,ProductLine,Weight,Size,PackSize,Status,InventoryDate,PurchasePrice
0,1,3-182,NaN,AT,182,Undershirts,Girls' Undershirts,Underwear,822,3,Dozen,In Production,7/10/2003,6.6
1,2,3-183,NaN,AT,183,Undershirts,Girls' Undershirts,Underwear,620,3,Dozen,Out of Production,7/10/2003,5.6
2,3,3-184,NaN,AT,184,Undershirts,Girls' Undershirts,Underwear,718,3,Dozen,In Production,7/10/2003,6.3
3,4,3-185,NaN,AT,185,Undershirts,Boys' Undershirts,Underwear,820,3,Dozen,In Production,7/10/2003,5.6
4,5,3-A30N,NaN,A,30,Briefs,Girls' Panties,Underwear,214,3,Dozen,Out of Production,8/6/2003,3.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4178,4419,L-BX46CK,NaN,BX,46,Boxers,Men's Briefs,Underwear,90,L,Single Unit,In Production,4/4/2006,1.3
4179,4420,M-BX46CK,NaN,BX,46,Boxers,Men's Briefs,Underwear,85,M,Single Unit,In Production,4/4/2006,1.2
4180,4421,XL-BX46CK,NaN,BX,46,Boxers,Men's Briefs,Underwear,100,XL,Single Unit,In Production,4/4/2006,1.4
4181,4422,L-D46D,NaN,D,46,Briefs,Women's Panties,Underwear,285,L,Dozen,In Production,4/4/2006,3.9
4182,4423,M-TV46,NaN,TV,46,Thongs,Women's Panties,Underwear,190,M,Dozen,In Production,4/18/2006,3.3

In [182]:
df_products = df_products.drop(columns=['FabricDescription'])

In [183]:
f.analysis_data(df_products, "products")

There are 4183 of products
-----------------------

Null values:

ProductID              0
ProductName            0
Color               4107
ModelDescription      10
Category               0
Gender                 0
ProductLine            0
Weight                 0
Size                  14
PackSize               0
Status                 0
InventoryDate          0
PurchasePrice          0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

ProductID           4183
ProductName         4183
Color                 18
ModelDescription     105
Category              10
Gender                12
ProductLine            2
Weight               705
Size                  24
PackSize               2
Status                 2
InventoryDate        112
PurchasePrice        231
dtype: int64
-----------------------

Description:
         ProductID       Weight  PurchasePrice
count  4183.000000  4183.000000    4183.000000
mean   2208.978962   364.256514       4.486679
std    1275.430066   243.470142       2.107469
min       1.000000    32.000000       0.350000
25%    1106.500000   209.000000       3.350000
50%    2192.000000   312.000000       4.300000
75%    3304.500000   460.000000       5.400000
max    4423.000000  2316.000000      14.000000
-----------------------

ProductID             int64
ProductName          object
Color                object
ModelDescription     object
Category             object
Gender               object
ProductLine          object
Weight                int64
Size                 object
PackSize             object
Status               object
InventoryDate        object
PurchasePrice       float64
dtype: object

In [184]:
# Drop color:

df_products = df_products.drop(columns=['Color'])

In [185]:
# Drop files with null values

df_products = df_products.dropna()

In [186]:
df_products['ProductName'].unique()

array(['3-182', '3-183', '3-184', ..., 'XL-BX46CK', 'L-D46D', 'M-TV46'],
      dtype=object)

In [187]:
df_products['ModelDescription'].unique()

array(['AT', 'A', 'BX', 'ERK', 'GB', 'K', 'O', 'U', 'AT3K', 'AT4K', 'BB',
       'C', 'D', 'G', 'GS', 'H', 'KA', 'KS', 'N', 'S', 'TA', 'Z', 'AF',
       'F', 'R', 'SLP', 'TAB', 'TIA', 'TO', 'ZF', 'PCL', 'W', 'X', 'KH',
       'SF', 'L', 'M', 'EE', 'EEV', 'TDDV', 'TEE', 'TEEP', 'TIEE', 'TTDD',
       'TTEE', 'AA', 'E', 'THB', 'B', 'TB', 'TIB', 'EES', 'T', 'FF',
       'BKAMP', 'SD', 'SKD', 'P', 'V', 'LL', 'Y', 'TEEB', 'TH', 'TTB',
       'TFF', 'TLL', 'TV', 'TBP', 'BAL', 'AH', 'BA', 'TAF', 'TBAL', 'TAL',
       'TT', 'ATL', 'AL', 'AS', 'TAG', 'BP', 'TAS', 'AG', 'AK', 'TAH',
       'BAD', 'BS', 'IS', 'ISAL', 'IT', 'FAN', 'SALS', 'IAG', 'AN', 'TBA',
       'SUT', 'AR', 'AP', 'AV', 'Any', 'FAV', 'TD', 'TE', 'TS',
       'TANGA KAMP', 'ERS'], dtype=object)

In [188]:
df_products['Category'].value_counts()

Category
Briefs                   2822
Thongs                    497
Undershirts               362
Boxers                    294
Slips                      73
Regular-Over the Calf      72
Drawers                    45
Cuff-Over the Calf          3
Any                         1
Name: count, dtype: int64

In [189]:
# Drop the row with any

df_products = df_products[df_products['Category']!='Any']

In [190]:
df_products['Category'].value_counts()

Category
Briefs                   2822
Thongs                    497
Undershirts               362
Boxers                    294
Slips                      73
Regular-Over the Calf      72
Drawers                    45
Cuff-Over the Calf          3
Name: count, dtype: int64

In [191]:
df_products['Gender'].unique()

array(["Girls' Undershirts", "Boys' Undershirts", "Girls' Panties",
       "Boys' Briefs", "Men's Undershirts", "Women's Undershirts",
       "Women's Panties", "Men's Briefs", "Children's Socks",
       "Women's Socks", "Men's Socks"], dtype=object)

In [192]:
df_products['ProductLine'].unique()

array(['Underwear', 'Socks'], dtype=object)

In [193]:
df_products['Weight'].unique()

array([ 822,  620,  718,  820,  214,   55,  389,  325,  340,  370,  345,
        330,  359,  294,  280,  281,  269,  276,  381,  242,  271,  329,
        273,  275,  282,  220,  305,  266,  290,  310,  225,  201,  233,
        226,  228,  257,  491,  455,  530,  482,  551,  177,  262,  293,
        291,  219,  202,  212,  211,  218,  252,  221,  553,  566,  590,
         51,   47,  328,  301,  240,  205,  256,  243,  270,  299,  239,
         88,  940, 1405,  117, 1245,  104,  935, 1165,   97, 1360,  113,
        116,   87,   95,  102,  128,   90,  112,   98,   94,  334,  336,
        353,  384,  374,  373,  395,  405,   70,   67,   66,   80,   79,
         75,   84,   83,  350,  365,  383,  380,  283,  515,  705,  695,
        575,  585,  610,  286,  390,  369,  401,  400,  732,  341,  480,
        322,  430,  460,  470,  505,  533,  525,  434,  431,  450,  495,
        428,  440,  425,  348,  419,  420,  461,  475,  478,  443,  449,
        506,  413,  474,  462,  463,  509,  500,  504,  516,  485,  456,
        517,  510,  520,  497,  502,  508,  503,  362,  296,  432,  730,
        690,  492,  337,  367,  376,  193,  206,  191,  323,  321,  980,
         78,  801,  746, 1285,  106,  890, 1095,   92,  845, 1005, 1171,
         91,  110,  120,   72,   93,   85,  107,  109,  264,  246,  311,
        335,  248,  287,  424,  317,  410,   60,   63,   61,   65,   82,
        263,  278,  349,  304,  315,  346,  237,  314,  572,  625,  528,
        579,  484,  208,  347,  372,  371,  355,  320,  393,  306,  435,
        360,  385,  445,  379,  465,  396,  415,  448,  447,  550,  442,
        444,  437,  324,  292,  300,  326,  351,  139,  172,  166,  185,
        197,  192,  190,  175,  186,  187,  162,  178,  180,  145,  168,
        167,  156,  144,  155,  319,  354,  662,   71,  101,   69,  111,
         89,  254,  245,  251,   57,   53,   76,   68,   64,  468,  352,
        327,  289,  386,  377,  358,  285,  265,  227,  260,  141,  125,
        147,  161,  154,  157,  171,  182,  165,  159,  174,  173,  146,
        160,  149,  158,  152,  142,  137,  207,  297, 1160,   99, 1044,
        131, 1265,  960, 1330, 1435, 1184,  140,  115,  490,   81,   96,
        426,  696,  635,  589,  429,  538,  561,  604,  519,  563,  524,
        564,  617,  641,  580,  587,  535,  539,  477,  665,  552,  499,
        531,  536,  557,  570,  555,  630,  607,  164,  361, 1100, 1530,
        121, 1410, 1490,  122, 1544,  108,  621,  658,  638,  670,  675,
        609,  565,  433,  494,  680,  661,  595,  571,  594,  527,  628,
        576,  691,  608,  660,  645,  728,  684,  632,  583,  416,  626,
        997, 1025, 1065, 1110, 1055, 1030,  977, 1075,  473, 1995,  720,
        710,  800,  810,  650,  537,  584,  592,  772,  760,  700,  708,
        640,  765,  685,  724,  835,  787,   74,  316, 1550, 1778, 1392,
        643,  597,  606,  666,  313,  338, 1070,  378,  209,  295,  427,
        183,  238,  512,  929,  995,   54,   59,  740,  612,  655,  312,
        234,  224, 1140, 1307,  573,  544,  668,  543,  785,  397,  398,
        745,  366,  975,  569,  875,  780, 1409,  467,  483,  481,  476,
        153,  133,  560,  581,  582,  469,  339,  446,  279,  408,  249,
        231,  288, 1185, 1295, 1125, 1000, 1175, 1155,  562,  652,  574,
        734,  927, 1217,  375,  274,  318,  649,  236,  258, 1085,  143,
        127,  119,  100,  213,  277,  216,  195,  241,  132,  169,  421,
        307,  511,  235,  230,  284,  130,  176,  253,  545,  247,  542,
        716,  781,  309,  865,  941,  464,  163,  150,  920,  925,  479,
        189,  203, 1850, 1578,  223,   45,   32,  418,  689,  114, 1080,
        344,  244, 1600, 2100, 1282, 1404, 1980, 2316,  232,  200,   43,
         52,   73,  333,  588,  259,  712,  529,  709,  409,  151,  126,
        268,  472,  105,  181,  215,  540,  342,  204,  368,  451,  725,
        830,  407,  452,  229,  775,  840,  184,  194,  885,  788,  910,
        521,  990,  687,  518,  818,  796,  950, 1090, 1020,  970,  466,
        895,  905,  636, 1006, 1045,  593, 1390,  556,  900,  878,   38,
       1149, 1610,  598,  770, 1035,  438,  736, 1134,   77,   56,   62,
        715,  735,  704,  559,  825,  880,  867,  733,  858,  805,  541,
       1179,  860,  672,  624,  591,  663, 1210, 1190, 1120, 1015, 1368,
        924, 1270,  618,  623,  138, 1250,  850,  267,  250,  388, 1107,
       1008, 1037,   58,   86,  261,  915,  969,  930,  343,  255,  148,
        199,  217,  188,  210,  198,  103,  750,  605, 1225,  170,  615,
        600,  135,  985,   50, 1475,  790,  522,  457, 1205, 1580, 1060,
        795, 1195, 1040,  815,  855,  926, 1275, 1375, 1950,  965, 1150])

In [194]:
df_products['Size'].unique()

# 13, 11, 9, 7, 5 -> Calcetines
# 4, 3,1,2 -> Bragas

array(['3', '1', '2', 'L', 'M', 'S', 'XL', 'XS', 'XXL', '3XL', '4XL',
       'S-M', 'L-XL', '5XL', '6XL', '5', '7', '9', '11', '35-40', '40-46',
       '4', '13'], dtype=object)

In [195]:
df_products['Size'] = df_products['Size'].replace({'1': 'XS', '2': 'S', '3': 'M', '4': 'L' })

In [196]:
df_products['Size'].unique()

array(['M', 'XS', 'S', 'L', 'XL', 'XXL', '3XL', '4XL', 'S-M', 'L-XL',
       '5XL', '6XL', '5', '7', '9', '11', '35-40', '40-46', '13'],
      dtype=object)

In [197]:
df_products['PackSize'].unique()

array(['Dozen', 'Single Unit'], dtype=object)

In [198]:
df_products['Status'].unique()

array(['In Production', 'Out of Production'], dtype=object)

In [199]:
df_products['InventoryDate'].unique()

array(['7/10/2003', '8/6/2003', '9/17/2003', '9/20/2003', '9/26/2003',
       '9/16/2003', '12/31/2003', '9/30/2003', '3/16/2004', '10/15/2003',
       '10/25/2003', '1/13/2004', '2/15/2005', '2/9/2004', '1/1/2004',
       '2/13/2004', '2/21/2004', '3/18/2004', '4/9/2004', '4/3/2004',
       '4/17/2004', '4/26/2004', '5/6/2004', '5/14/2004', '5/17/2004',
       '5/25/2004', '5/29/2004', '6/2/2004', '6/1/2004', '6/27/2004',
       '11/20/2004', '8/25/2004', '8/28/2004', '7/7/2004', '8/18/2004',
       '9/1/2004', '11/4/2004', '8/31/2004', '9/14/2004', '10/11/2004',
       '10/26/2004', '10/27/2004', '11/15/2004', '10/29/2004',
       '11/3/2004', '11/13/2004', '11/18/2004', '11/19/2004',
       '11/22/2004', '12/2/2004', '12/3/2004', '12/15/2004', '12/22/2004',
       '1/25/2005', '3/31/2005', '4/19/2005', '4/11/2005', '4/25/2005',
       '5/6/2005', '5/18/2005', '6/7/2005', '6/20/2005', '6/22/2005',
       '6/29/2005', '7/5/2005', '7/6/2005', '7/13/2005', '7/29/2005',
       '7/30/2005', '8/1/2005', '8/4/2005', '8/5/2005', '8/8/2005',
       '8/11/2005', '8/16/2005', '8/24/2005', '8/25/2005', '8/30/2005',
       '8/31/2005', '9/9/2005', '9/10/2005', '9/19/2005', '9/22/2005',
       '9/24/2005', '9/30/2005', '10/6/2005', '10/19/2005', '10/26/2005',
       '10/28/2005', '10/31/2005', '11/23/2005', '12/7/2005', '1/12/2006',
       '1/23/2006', '2/14/2006', '2/16/2006', '2/18/2006', '2/19/2006',
       '2/23/2006', '3/13/2006', '3/14/2006', '3/15/2006', '3/15/2005',
       '3/20/2006', '3/21/2006', '3/22/2006', '3/23/2006', '4/3/2006',
       '4/4/2006', '4/18/2006'], dtype=object)

In [200]:
df_products['PurchasePrice'].min(), df_products['PurchasePrice'].max()

(np.float64(0.4), np.float64(14.0))

In [201]:
f.analysis_data(df_products, "products")

There are 4168 of products
-----------------------

Null values:

ProductID           0
ProductName         0
ModelDescription    0
Category            0
Gender              0
ProductLine         0
Weight              0
Size                0
PackSize            0
Status              0
InventoryDate       0
PurchasePrice       0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

ProductID           4168
ProductName         4168
ModelDescription     104
Category               8
Gender                11
ProductLine            2
Weight               704
Size                  19
PackSize               2
Status                 2
InventoryDate        110
PurchasePrice        229
dtype: int64
-----------------------

Description:
         ProductID       Weight  PurchasePrice
count  4168.000000  4168.000000    4168.000000
mean   2213.909789   364.810461       4.494602
std    1273.275500   243.162759       2.105163
min       1.000000    32.000000       0.400000
25%    1112.750000   210.000000       3.400000
50%    2197.500000   313.500000       4.300000
75%    3307.250000   460.000000       5.400000
max    4423.000000  2316.000000      14.000000
-----------------------

ProductID             int64
ProductName          object
ModelDescription     object
Category             object
Gender               object
ProductLine          object
Weight                int64
Size                 object
PackSize             object
Status               object
InventoryDate        object
PurchasePrice       float64
dtype: object

In [202]:
# Create new column

df_products['ProductType'] = df_products['ProductName'].str.split('-', expand=True)[1]

In [203]:
df_products['ProductType'].unique()
df_products['ProductType'].nunique()

1342

### 1.5 Orders

Summary:

In total, there are 2286 orders 

- **CustomerID**
- **EmployeeID**
- **ShippingMethodID**
- **OrderDate**: from 2003 to 2006
- **ShipDate**: from 2003 to 2006
- **FreightCharge**: in range (0-62) --> is the amount paid to a carrier company for the transportation of goods from the point of origin to an agreed location.

In [204]:
df_orders

,OrderID,CustomerID,EmployeeID,ShippingMethodID,OrderDate,ShipDate,FreightCharge
0,2,1,1,1.0,7/10/2003,7/10/2003,0.0
1,4,2,2,1.0,7/11/2003,7/11/2003,0.0
2,5,2,1,1.0,7/15/2003,7/15/2003,0.0
3,6,3,1,1.0,7/14/2003,7/14/2003,0.0
4,7,4,1,1.0,7/14/2003,7/15/2003,0.0
...,...,...,...,...,...,...,...
2281,2466,40,8,1.0,4/14/2006,4/14/2006,0.0
2282,2467,7,8,1.0,4/14/2006,4/14/2006,0.0
2283,2468,82,8,1.0,4/18/2006,4/18/2006,31.0
2284,2469,231,8,1.0,4/19/2006,4/19/2006,0.0
2285,2470,231,8,1.0,4/20/2006,4/20/2006,0.0

In [205]:
f.analysis_data(df_orders, "orders")

There are 2286 of orders
-----------------------

Null values:

OrderID             0
CustomerID          0
EmployeeID          0
ShippingMethodID    8
OrderDate           0
ShipDate            0
FreightCharge       0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

OrderID             2286
CustomerID           222
EmployeeID            10
ShippingMethodID       2
OrderDate            746
ShipDate             755
FreightCharge         34
dtype: int64
-----------------------

Description:
           OrderID   CustomerID   EmployeeID  ShippingMethodID  FreightCharge
count  2286.000000  2286.000000  2286.000000       2278.000000    2286.000000
mean   1250.100612    60.120735     5.804024          1.001756       6.451470
std     713.083431    67.505833     3.683080          0.059248      12.477724
min       2.000000     1.000000     1.000000          1.000000       0.000000
25%     646.250000     8.000000     2.000000          1.000000       0.000000
50%    1264.500000    25.000000     6.000000          1.000000       0.000000
75%    1861.750000    86.000000     6.000000          1.000000       0.000000
max    2470.000000   247.000000    16.000000          3.000000      62.000000
-----------------------

OrderID               int64
CustomerID            int64
EmployeeID            int64
ShippingMethodID    float64
OrderDate            object
ShipDate             object
FreightCharge       float64
dtype: object

In [206]:
# Drop null values 
df_orders = df_orders.dropna()

In [207]:
# ShippingMethod to int
df_orders['ShippingMethodID'] = df_orders['ShippingMethodID'].astype(int)

C:\Users\Carlota\AppData\Local\Temp\ipykernel_16100\1252252510.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_orders['ShippingMethodID'] = df_orders['ShippingMethodID'].astype(int)

In [208]:
df_orders['FreightCharge'].min(), df_orders['FreightCharge'].max()

(np.float64(0.0), np.float64(62.0))

### 1.6 Order Details

Summary: 

In total, there are 105757 sold products in 2286 purchases

- **QuantitySold**: 0 to 612
- **UnitSalesPrice:** 0 to 35
- **total_price:** (0.0, 2427.6)

In [209]:
df_order_details

        OrderDetailID  OrderID  ProductID  QuantitySold  UnitSalesPrice
0                   2        2        955             5             7.5
1                   3        2        958             5             8.5
2                   5        2        959             5             8.5
3                   6        4         72            50             3.0
4                   7        4          9            50             3.2
...               ...      ...        ...           ...             ...
105752         114665     2470       4342            20             1.7
105753         114666     2470       4419            10             1.9
105754         114667     2470       4343            20             1.9
105755         114668     2470       4421            10             2.1
105756         114669     2470       4344            20             2.0

[105757 rows x 5 columns]

In [210]:
f.analysis_data(df_order_details, "order details")

There are 105757 of order details
-----------------------

Null values:

OrderDetailID     0
OrderID           0
ProductID         0
QuantitySold      0
UnitSalesPrice    0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

OrderDetailID     105757
OrderID             2286
ProductID           4042
QuantitySold         165
UnitSalesPrice       237
dtype: int64
-----------------------

Description:
       OrderDetailID        OrderID      ProductID   QuantitySold  \
count  105757.000000  105757.000000  105757.000000  105757.000000
mean    57640.985637    1408.270724    1318.742050       6.467714
std     33255.220484     677.963001    1027.571729       9.572008
min         2.000000       2.000000       1.000000       0.000000
25%     28762.000000     843.000000     566.000000       1.000000
50%     58024.000000    1470.000000     988.000000       4.000000
75%     86424.000000    1999.000000    1942.000000      10.000000
max    114669.000000    2470.000000    4423.000000     612.000000

       UnitSalesPrice
count   105757.000000
mean         6.789183
std          3.061123
min          0.000000
25%          4.800000
50%          6.300000
75%          8.200000
max         35.000000
-----------------------

OrderDetailID       int64
OrderID             int64
ProductID           int64
QuantitySold        int64
UnitSalesPrice    float64
dtype: object

In [211]:
df_order_details['total_price'] = df_order_details['UnitSalesPrice'] * df_order_details['QuantitySold']

In [212]:
df_order_details['total_price'].min(), df_order_details['total_price'].max()

(np.float64(0.0), np.float64(2427.6))

### 1.7 Payments

Summary:

- **total payments :** 685 (not all orders have a payment register)
- **payment date:** from 2003 to 2005
- **payment amount:** 0.0 - 20534.7

In [213]:
df_payments

     PaymentID  OrderID  PaymentMethodID PaymentDate PaymentAmount
0            1        2              1.0   7/10/2003        603.50
1            2        4              1.0   7/12/2003      1,288.00
2            4        5              1.0   7/15/2003      1,800.00
3            5        6              1.0   7/14/2003        389.50
4            6        7              1.0   7/15/2003      1,479.00
..         ...      ...              ...         ...           ...
681        695     1526              1.0    3/1/2005      4,409.80
682        696     1531              1.0    3/1/2005      1,318.00
683        697     1541              1.0    3/9/2005        954.95
684        698     1546              1.0   3/11/2005      1,233.00
685        699     1662              1.0    6/4/2005      2,163.60

[686 rows x 5 columns]

In [214]:
f.analysis_data(df_payments, 'payments')

There are 686 of payments
-----------------------

Null values:

PaymentID          0
OrderID            0
PaymentMethodID    1
PaymentDate        0
PaymentAmount      1
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

PaymentID          686
OrderID            658
PaymentMethodID      2
PaymentDate        225
PaymentAmount      672
dtype: int64
-----------------------

Description:
        PaymentID      OrderID  PaymentMethodID
count  686.000000   686.000000       685.000000
mean   353.303207   378.440233         1.054015
std    201.715659   257.742929         0.226212
min      1.000000     2.000000         1.000000
25%    181.250000   178.250000         1.000000
50%    355.500000   359.500000         1.000000
75%    527.750000   566.750000         1.000000
max    699.000000  1864.000000         2.000000
-----------------------

PaymentID            int64
OrderID              int64
PaymentMethodID    float64
PaymentDate         object
PaymentAmount       object
dtype: object

In [215]:
# drop null

df_payments = df_payments.dropna()

In [216]:
df_payments['PaymentMethodID'] = df_payments['PaymentMethodID'].astype(int)

C:\Users\Carlota\AppData\Local\Temp\ipykernel_16100\1916110609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_payments['PaymentMethodID'] = df_payments['PaymentMethodID'].astype(int)

In [217]:
df_payments['PaymentDate'].unique()

array(['7/10/2003', '7/12/2003', '7/15/2003', '7/14/2003', '7/16/2003',
       '7/17/2003', '7/18/2003', '7/19/2003', '7/21/2003', '7/22/2003',
       '7/23/2003', '7/24/2003', '7/25/2003', '7/28/2003', '7/29/2003',
       '7/30/2003', '7/31/2003', '8/1/2003', '8/2/2003', '8/5/2003',
       '8/6/2003', '8/7/2003', '8/8/2003', '8/9/2003', '8/11/2003',
       '8/12/2003', '8/13/2003', '8/14/2003', '8/15/2003', '8/16/2003',
       '8/18/2003', '8/19/2003', '8/20/2003', '8/22/2003', '8/23/2003',
       '8/25/2003', '8/26/2003', '8/27/2003', '8/28/2003', '8/29/2003',
       '8/30/2003', '9/2/2003', '9/1/2003', '9/3/2003', '9/4/2003',
       '9/5/2003', '9/6/2003', '9/9/2003', '9/10/2003', '9/11/2003',
       '9/12/2003', '9/15/2003', '9/16/2003', '9/13/2003', '9/17/2003',
       '9/18/2003', '9/19/2003', '9/23/2003', '9/24/2003', '9/25/2003',
       '9/26/2003', '9/29/2003', '9/27/2003', '10/1/2003', '9/30/2003',
       '10/2/2003', '10/3/2003', '10/6/2003', '10/7/2003', '10/8/2003',
       '10/9/2003', '10/10/2003', '10/13/2003', '10/14/2003',
       '10/15/2003', '10/16/2003', '10/18/2003', '10/17/2003',
       '10/20/2003', '10/21/2003', '10/22/2003', '10/23/2003',
       '10/24/2003', '10/25/2003', '10/27/2003', '10/28/2003',
       '10/29/2003', '10/30/2003', '10/31/2003', '11/3/2003', '11/4/2003',
       '11/5/2003', '11/6/2003', '11/1/2003', '11/7/2003', '11/10/2003',
       '11/11/2003', '11/12/2003', '11/13/2003', '11/14/2003',
       '11/17/2003', '11/18/2003', '11/19/2003', '11/20/2003',
       '11/21/2003', '11/22/2003', '11/24/2003', '11/25/2003',
       '11/26/2003', '11/28/2003', '12/1/2003', '11/29/2003', '12/2/2003',
       '12/3/2003', '12/6/2003', '12/8/2003', '12/9/2003', '12/10/2003',
       '12/12/2003', '12/15/2003', '12/16/2003', '12/18/2003',
       '12/19/2003', '12/20/2003', '12/22/2003', '12/23/2003',
       '12/24/2003', '12/25/2003', '12/26/2003', '12/27/2003',
       '12/30/2003', '1/5/2004', '1/10/2004', '1/14/2004', '1/13/2004',
       '1/12/2004', '1/15/2004', '1/16/2004', '1/19/2004', '1/20/2004',
       '1/23/2004', '1/24/2004', '1/26/2004', '1/28/2004', '1/30/2004',
       '1/31/2004', '2/3/2004', '2/6/2004', '2/4/2004', '2/5/2004',
       '2/2/2004', '2/7/2004', '2/9/2004', '2/10/2004', '2/20/2004',
       '2/16/2004', '2/14/2004', '2/13/2004', '2/18/2004', '2/12/2004',
       '2/11/2004', '2/19/2004', '2/17/2004', '2/21/2004', '2/24/2004',
       '2/27/2004', '2/25/2004', '3/2/2004', '2/28/2004', '2/26/2004',
       '3/1/2004', '2/23/2004', '3/3/2004', '3/22/2004', '3/24/2004',
       '3/4/2004', '3/5/2004', '3/17/2004', '3/12/2004', '3/26/2004',
       '4/9/2004', '3/6/2004', '3/15/2004', '3/11/2004', '3/16/2004',
       '3/18/2004', '3/19/2004', '3/23/2004', '4/2/2004', '4/10/2004',
       '3/25/2004', '4/1/2004', '3/13/2004', '4/3/2004', '3/29/2004',
       '3/30/2004', '4/5/2004', '3/9/2004', '4/6/2003', '4/6/2004',
       '4/22/2004', '3/10/2004', '4/29/2004', '4/19/2004', '4/15/2004',
       '4/7/2004', '4/23/2004', '4/14/2004', '4/12/2004', '4/13/2004',
       '4/8/2004', '4/21/2004', '4/20/2004', '4/17/2004', '4/16/2004',
       '5/5/2004', '5/17/2004', '5/19/2004', '8/22/2005', '9/10/2005',
       '2/22/2005', '3/1/2005', '3/9/2005', '3/11/2005', '6/4/2005'],
      dtype=object)

In [218]:
df_payments['PaymentAmount']

0        603.50
1      1,288.00
2      1,800.00
3        389.50
4      1,479.00
         ...
681    4,409.80
682    1,318.00
683      954.95
684    1,233.00
685    2,163.60
Name: PaymentAmount, Length: 684, dtype: object

In [219]:
# Convert to float payment amount
df_payments['PaymentAmount'] = df_payments['PaymentAmount'].str.replace(',', '')
df_payments['PaymentAmount'] = df_payments['PaymentAmount'].astype(float)

C:\Users\Carlota\AppData\Local\Temp\ipykernel_16100\3834569737.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_payments['PaymentAmount'] = df_payments['PaymentAmount'].str.replace(',', '')
C:\Users\Carlota\AppData\Local\Temp\ipykernel_16100\3834569737.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_payments['PaymentAmount'] = df_payments['PaymentAmount'].astype(float)

In [220]:
df_payments['PaymentAmount'].min(), df_payments['PaymentAmount'].max()

(np.float64(0.0), np.float64(20534.7))

### 1.8 Payment Methods

In [221]:
df_payment_methods

   PaymentMethodID  PaymentMethod
0                1           Cash
1                2  Bank Transfer
2                3      On Credit

In [222]:
f.analysis_data(df_payment_methods, 'payments methods')

There are 3 of payments methods
-----------------------

Null values:

PaymentMethodID    0
PaymentMethod      0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

PaymentMethodID    3
PaymentMethod      3
dtype: int64
-----------------------

Description:
       PaymentMethodID
count              3.0
mean               2.0
std                1.0
min                1.0
25%                1.5
50%                2.0
75%                2.5
max                3.0
-----------------------

PaymentMethodID     int64
PaymentMethod      object
dtype: object

In [223]:
df_total_payments = pd.merge(df_payment_methods, df_payments, on='PaymentMethodID', how='outer')

In [224]:
df_total_payments = df_total_payments.drop(columns='PaymentMethodID')

In [225]:
df_total_payments

     PaymentMethod  PaymentID  OrderID PaymentDate  PaymentAmount
0             Cash        1.0      2.0   7/10/2003         603.50
1             Cash        2.0      4.0   7/12/2003        1288.00
2             Cash        4.0      5.0   7/15/2003        1800.00
3             Cash        5.0      6.0   7/14/2003         389.50
4             Cash        6.0      7.0   7/15/2003        1479.00
..             ...        ...      ...         ...            ...
680  Bank Transfer      624.0    696.0    4/1/2004        1502.17
681  Bank Transfer      676.0    678.0   3/30/2004         313.70
682  Bank Transfer      682.0    709.0    4/8/2004        3263.70
683  Bank Transfer      691.0    789.0   5/19/2004        1595.50
684      On Credit        NaN      NaN         NaN            NaN

[685 rows x 5 columns]

In [226]:
df_total_payments.isna().sum()

PaymentMethod    0
PaymentID        1
OrderID          1
PaymentDate      1
PaymentAmount    1
dtype: int64

In [227]:
df_total_payments = df_total_payments.dropna()

### 1.9 Shipping Methods

In [228]:
df_shipping_methods

   ShippingMethodID        ShippingMethod
0                 1              Ex Works
1                 2  Door to Door Service
2                 3             Container
3                 4                 Truck

In [229]:
f.analysis_data(df_shipping_methods, 'shipping methods')

There are 4 of shipping methods
-----------------------

Null values:

ShippingMethodID    0
ShippingMethod      0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

ShippingMethodID    4
ShippingMethod      4
dtype: int64
-----------------------

Description:
       ShippingMethodID
count          4.000000
mean           2.500000
std            1.290994
min            1.000000
25%            1.750000
50%            2.500000
75%            3.250000
max            4.000000
-----------------------

ShippingMethodID     int64
ShippingMethod      object
dtype: object

### 1.10 Suppliers

In [230]:
df_suppliers

   SupplierID SupplierName
0           1           S1
1           2           S2

In [231]:
f.analysis_data(df_suppliers, "suppliers")

There are 2 of suppliers
-----------------------

Null values:

SupplierID      0
SupplierName    0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

SupplierID      2
SupplierName    2
dtype: int64
-----------------------

Description:
       SupplierID
count    2.000000
mean     1.500000
std      0.707107
min      1.000000
25%      1.250000
50%      1.500000
75%      1.750000
max      2.000000
-----------------------

SupplierID       int64
SupplierName    object
dtype: object

### 1.11 Purchase Orders

In [232]:
df_purchase_orders

     PurchaseOrderID  SupplierID  EmployeeID  ShippingMethodID   OrderDate
0                 25           1           1               3.0  10/15/2003
1                 27           1           1               3.0   9/16/2003
2                 28           1           1               3.0   9/17/2003
3                 29           1           1               3.0   9/17/2003
4                 30           1           1               3.0   9/17/2003
..               ...         ...         ...               ...         ...
227              311           1          15               2.0   3/20/2006
228              312           1          15               2.0   3/20/2006
229              313           1          15               2.0   3/21/2006
230              314           1          15               2.0   3/22/2006
231              315           1           1               2.0    4/5/2006

[232 rows x 5 columns]

In [233]:
f.analysis_data(df_purchase_orders, "purchase orders")

There are 232 of purchase orders
-----------------------

Null values:

PurchaseOrderID     0
SupplierID          0
EmployeeID          0
ShippingMethodID    5
OrderDate           0
dtype: int64
-----------------------

Number duplicated rows: 0

-----------------------

PurchaseOrderID     232
SupplierID            2
EmployeeID            6
ShippingMethodID      3
OrderDate           138
dtype: int64
-----------------------

Description:
       PurchaseOrderID  SupplierID  EmployeeID  ShippingMethodID
count       232.000000  232.000000  232.000000        227.000000
mean        174.025862    1.030172    6.931034          2.140969
std          84.287691    0.171431    5.008606          0.373272
min          25.000000    1.000000    1.000000          1.000000
25%         103.750000    1.000000    3.000000          2.000000
50%         175.500000    1.000000    6.000000          2.000000
75%         247.250000    1.000000    6.000000          2.000000
max         315.000000    2.000000   15.000000          3.000000
-----------------------

PurchaseOrderID       int64
SupplierID            int64
EmployeeID            int64
ShippingMethodID    float64
OrderDate            object
dtype: object

In [234]:
# drop null values 

df_purchase_orders = df_purchase_orders.dropna()

# convert to int shipping method id

df_purchase_orders['ShippingMethodID'] = df_purchase_orders['ShippingMethodID'].astype(int)

C:\Users\Carlota\AppData\Local\Temp\ipykernel_16100\2365127855.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_purchase_orders['ShippingMethodID'] = df_purchase_orders['ShippingMethodID'].astype(int)

In [235]:
# merge data

df_purchase_orders = pd.merge(df_purchase_orders, df_shipping_methods, on = 'ShippingMethodID',how='inner')
df_purchase_orders = pd.merge(df_purchase_orders, df_suppliers, on = 'SupplierID',how='inner')

In [236]:
df_purchase_orders

,PurchaseOrderID,SupplierID,EmployeeID,ShippingMethodID,OrderDate,ShippingMethod,SupplierName
0,25,1,1,3,10/15/2003,Container,S1
1,27,1,1,3,9/16/2003,Container,S1
2,28,1,1,3,9/17/2003,Container,S1
3,29,1,1,3,9/17/2003,Container,S1
4,30,1,1,3,9/17/2003,Container,S1
...,...,...,...,...,...,...,...
222,311,1,15,2,3/20/2006,Door to Door Service,S1
223,312,1,15,2,3/20/2006,Door to Door Service,S1
224,313,1,15,2,3/21/2006,Door to Door Service,S1
225,314,1,15,2,3/22/2006,Door to Door Service,S1
226,315,1,1,2,4/5/2006,Door to Door Service,S1

In [237]:
df_purchase_orders = df_purchase_orders.drop(columns=['SupplierID', 'ShippingMethodID'])

In [238]:
df_purchase_orders

,PurchaseOrderID,EmployeeID,OrderDate,ShippingMethod,SupplierName
0,25,1,10/15/2003,Container,S1
1,27,1,9/16/2003,Container,S1
2,28,1,9/17/2003,Container,S1
3,29,1,9/17/2003,Container,S1
4,30,1,9/17/2003,Container,S1
...,...,...,...,...,...
222,311,15,3/20/2006,Door to Door Service,S1
223,312,15,3/20/2006,Door to Door Service,S1
224,313,15,3/21/2006,Door to Door Service,S1
225,314,15,3/22/2006,Door to Door Service,S1
226,315,1,4/5/2006,Door to Door Service,S1

## 2. Save clean data

In [242]:
df_total_payments.to_csv("../Datasets/clean_total_payments.csv")
df_purchase_orders.to_csv("../Datasets/clean_purchase_orders.csv")
df_customer.to_csv("../Datasets/clean_customer.csv")
df_employees.to_csv("../Datasets/clean_employees.csv")
df_inventory.to_csv("../Datasets/clean_inventory.csv")
df_order_details.to_csv("../Datasets/clean_order_details.csv")
df_orders.to_csv("../Datasets/clean_orders.csv")
df_products.to_csv("../Datasets/clean_products.csv")